{
  "backend/main.mo": "Main backend actor that includes authorization and blob storage mixins, initializing access control state and composing functionality from MixinAuthorization and MixinStorage.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including landing page hero section, about section, problem-solution section, security section, and global capability section with associated files, components, and test IDs.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the AXOPAY application with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application router configuration using TanStack Router, defining all routes for public pages (landing, login, signup), client dashboard pages, and admin pages with their respective layouts.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin layout component with sidebar navigation for admin features (dashboard, users, financial, plans, config, rewards, reports, notifications), header with logout, and responsive mobile menu.",
  "frontend/src/components/layout/MainLayout.tsx": "Client layout component with sidebar navigation for user features (dashboard, wallet, plans, referrals, binary, rewards, earnings, profile), header with logout, and responsive mobile menu.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public-facing layout component with header containing AXOPAY branding and login/signup buttons, main content outlet, and footer with copyright and caffeine.ai attribution.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance using Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes (primary, secondary, accent, etc.) and utility classes for gradients.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard displaying platform metrics including user counts, deposits, withdrawals, revenue, and pending approvals using card-based layout with icons.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login page with form for admin ID and password authentication, integrating Internet Identity and displaying 2FA requirement notice.",
  "frontend/src/pages/admin/FinancialControlPage.tsx": "Placeholder page for financial control features with info alert indicating pending backend integration for deposit and withdrawal management.",
  "frontend/src/pages/admin/NotificationsPage.tsx": "Placeholder page for system notifications and announcements management with info alert about future implementation.",
  "frontend/src/pages/admin/PlanManagementPage.tsx": "Placeholder page for investment plan configuration with info alert indicating pending backend integration.",
  "frontend/src/pages/admin/ReferralBinaryConfigPage.tsx": "Placeholder page for referral and binary system configuration settings with info alert about future implementation.",
  "frontend/src/pages/admin/ReportsPage.tsx": "Placeholder page for platform analytics and reports with info alert indicating pending backend integration.",
  "frontend/src/pages/admin/RewardsManagementPage.tsx": "Placeholder page for milestone rewards configuration with info alert about future implementation.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Placeholder page for user account and permissions management with info alert indicating pending backend integration.",
  "frontend/src/pages/client/BinaryPage.tsx": "Client binary system page showing left/right leg volumes, matched pairs, carry forward, daily earnings limit progress, and pair income tracking.",
  "frontend/src/pages/client/DashboardPage.tsx": "Client dashboard displaying wallet balances (main, earnings, withdrawal), active plan ROI progress, total earnings breakdown, team size, and recent transactions list.",
  "frontend/src/pages/client/EarningsPage.tsx": "Displays earnings breakdown by type (ROI, referral, binary, rewards) with total earnings cards and a transaction history table with filtering and export functionality.",
  "frontend/src/pages/client/PlansPage.tsx": "Shows available investment plans (BEGIN, GROW, PEAK) with pricing and features, plus an active plan ROI tracker displaying progress, earnings, and remaining days.",
  "frontend/src/pages/client/ProfilePage.tsx": "Profile management page with tabs for personal info, security, KYC, and notifications; currently shows placeholder content with an alert indicating future backend integration.",
  "frontend/src/pages/client/ReferralPage.tsx": "Referral system page displaying referral stats, copyable referral link, and a list of direct referrals with their join dates, plans, and status.",
  "frontend/src/pages/client/RewardsPage.tsx": "Milestone rewards page showing progress toward achievement goals with claimable bonuses and a history of previously claimed rewards.",
  "frontend/src/pages/client/WalletPage.tsx": "Wallet management page with tabs for overview, deposit, withdraw, transfer, convert, and history; currently shows wallet balances and placeholder content for future functionality.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Password reset page with email input form that displays a success message after submission.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature cards showcasing global payments/transfers, and problem-solution sections promoting AXOPAY's services.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/username and password fields that integrates Internet Identity authentication and redirects to dashboard on success.",
  "frontend/src/pages/SignupPage.tsx": "Registration page with multi-field form (name, email, phone, password, country, referral) that validates input and triggers Internet Identity login flow.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and design tokens for a multi-theme UI system with sidebar, chart, and semantic color variables.",
  "project_state.json": "Project state document for AXOPAY, a global digital wallet and payment platform with multi-currency support, ROI plans, binary matching engine, referral/reward system, and comprehensive admin controls across public website, client portal, and admin panel modules."
}