{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "AXOPAY Digital Wallet Platform Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create public landing page hero section with headline, subtext, CTA buttons, and visual elements",
      "acceptanceCriteria": [
        "Hero section displays the exact headline and subtext",
        "Both Get Started and Login buttons are functional",
        "Visual design incorporates secure shield and digital network imagery"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "create",
          "description": "Create landing page component with hero section displaying headline 'Borderless Payments. Limitless Possibilities.', subtext 'Modern digital finance platform for global transactions', Get Started and Login buttons, and background image using the generated hero-bg.dim_1920x1080.png from frontend/public/assets/generated/hero-bg.dim_1920x1080.png"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for LandingPage at root path '/' and wire navigation for Get Started and Login buttons to appropriate routes"
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create About section explaining AXOPAY capabilities on landing page",
      "acceptanceCriteria": [
        "About section lists all four key capabilities",
        "Content is clearly structured and readable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add About section to LandingPage listing four capabilities: global money transfer, payment receiving, instant currency swap, and unified multi-currency wallet with clear structure and icons"
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create Problem-Solution section contrasting challenges with AXOPAY solutions",
      "acceptanceCriteria": [
        "Problems are displayed with clear visual distinction from solutions",
        "All five solutions are listed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add Problem-Solution section showing problems (Expensive, Slow, Complex, Limited access) contrasted with solutions (International payment gateway, Multi-currency support, Instant swap, Unified wallet, Cyber-security focus) using visual distinction"
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create Security & Trust section highlighting encryption and monitoring features",
      "acceptanceCriteria": [
        "All four security features are displayed",
        "Section conveys trust and security visually"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add Security & Trust section displaying end-to-end encryption, secure infrastructure, fraud detection, and advanced monitoring with shield icon from frontend/public/assets/generated/shield-icon.dim_256x256.png"
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create Global Capability section explaining international payment features",
      "acceptanceCriteria": [
        "All three capabilities are listed",
        "Content emphasizes global reach"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add Global Capability section highlighting international payment acceptance, multi-currency processing, and scalable global gateway with network illustration from frontend/public/assets/generated/global-network.dim_800x600.png"
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Create Plans & Benefits section displaying three investment tiers with ROI example",
      "acceptanceCriteria": [
        "All three plans are displayed with their prices",
        "ROI example (5% daily × 30 days) is clearly shown",
        "Plans are visually distinct and easy to compare"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add Plans & Benefits section showing BEGIN ($100), GROW ($300), PEAK ($500) plans with 5% daily returns example over 30 days, using growth chart from frontend/public/assets/generated/growth-chart.dim_600x400.png"
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create Referral System section explaining bonuses and binary pairing rewards",
      "acceptanceCriteria": [
        "Referral bonus percentage (10%) is displayed",
        "Binary pair income amounts are shown for all three tiers",
        "Daily limits and milestone rewards are mentioned"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add Referral System section explaining 10% direct bonus, multi-level earnings, and binary pairing with pair income ($10/$30/$50), daily limits, and milestone rewards, using binary tree diagram from frontend/public/assets/generated/binary-tree.dim_400x400.png"
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create final CTA section with headline and action buttons",
      "acceptanceCriteria": [
        "CTA headline is displayed prominently",
        "Both buttons are functional and styled distinctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add final CTA section with headline 'Join AXOPAY Today — Secure Your Financial Future' and Create Account and Login buttons linking to respective routes"
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement client login form with email/username, password, OTP verification, and forgot password",
      "acceptanceCriteria": [
        "Login form accepts both email and username",
        "OTP verification is required after password entry",
        "Forgot password flow allows password reset"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "create",
          "description": "Create login page with form accepting email/username and password fields, OTP verification step modal, and forgot password link. Use the authorization component to handle authentication after OTP verification. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/OTPVerificationModal.tsx",
          "operation": "create",
          "description": "Create reusable OTP verification modal component accepting 6-digit code with resend functionality and validation"
        },
        {
          "path": "frontend/src/pages/ForgotPasswordPage.tsx",
          "operation": "create",
          "description": "Create forgot password page with email input and reset request form, displaying success message after submission"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add routes for /login and /forgot-password pages"
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement client sign-up form collecting user details and optional referral ID",
      "acceptanceCriteria": [
        "Registration form collects all required fields",
        "Referral ID field is optional",
        "OTP is sent and verified before account activation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "create",
          "description": "Create signup page with registration form collecting name, email, phone, password, country dropdown, and optional referral ID field. Include OTP verification step using OTPVerificationModal. Use the authorization component to complete registration. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /signup page and wire navigation from landing page Get Started and Create Account buttons"
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Implement separate admin authentication portal with 2FA and optional IP restriction",
      "acceptanceCriteria": [
        "Admin login is on a separate route from client login",
        "Admin ID and password are required",
        "2FA is enforced for all admin logins",
        "IP restriction can be configured and enforced per admin account"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "create",
          "description": "Create admin login page at /admin/login with form accepting admin ID and password, mandatory 2FA verification modal, and IP restriction notice if applicable. Use the authorization component with admin role checking. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TwoFactorModal.tsx",
          "operation": "create",
          "description": "Create 2FA verification modal component with 6-digit authenticator code input and validation"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /admin/login separate from regular client login"
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Create client dashboard main overview displaying wallet metrics and activity",
      "acceptanceCriteria": [
        "All metrics are displayed on the dashboard",
        "Data is fetched from backend and updated in real-time",
        "Recent transactions show at least the last 5-10 entries"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/DashboardPage.tsx",
          "operation": "create",
          "description": "Create client dashboard page displaying wallet balance (Main, Earnings, Withdrawal), active plan, ROI progress bar, total earnings, referral income, binary income, withdrawable balance, team size, and recent transactions table. Fetch data using React Query hooks from backend. Use the authorization component to ensure user-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useDashboardData.ts",
          "operation": "create",
          "description": "Create React Query hook to fetch dashboard overview data from backend including all wallet balances, earnings breakdown, and team metrics with polling for live updates"
        },
        {
          "path": "frontend/src/components/client/WalletBalanceCard.tsx",
          "operation": "create",
          "description": "Create wallet balance display card component showing three wallet types (Main, Earnings, Withdrawal) with current balances"
        },
        {
          "path": "frontend/src/components/client/RecentTransactionsTable.tsx",
          "operation": "create",
          "description": "Create recent transactions table component displaying last 10 transactions with date, type, amount, and status columns"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /dashboard requiring authentication, wire login success to redirect here"
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Implement wallet features for deposits, withdrawals, transfers, and currency conversion",
      "acceptanceCriteria": [
        "Users can initiate deposits with external gateway integration placeholder",
        "Withdrawal requests are created and pending admin approval",
        "Internal transfers move funds between user accounts instantly",
        "Currency conversion uses configured exchange rates",
        "Transaction history shows all wallet activity with filters",
        "Three distinct wallet balances (Main, Earnings, Withdrawal) are maintained and displayed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/WalletPage.tsx",
          "operation": "create",
          "description": "Create wallet management page with tabs for Deposit, Withdraw, Transfer, Convert, and History. Display three wallet types prominently. Fetch data using React Query hooks from backend."
        },
        {
          "path": "frontend/src/components/client/DepositForm.tsx",
          "operation": "create",
          "description": "Create deposit form component with amount input, wallet selection (Main), currency dropdown, and placeholder payment gateway integration message. Submit deposit request to backend."
        },
        {
          "path": "frontend/src/components/client/WithdrawalForm.tsx",
          "operation": "create",
          "description": "Create withdrawal form component with amount input, source wallet (Withdrawal), withdrawal method selection, and OTP verification before submission. Submit withdrawal request to backend for admin approval."
        },
        {
          "path": "frontend/src/components/client/TransferForm.tsx",
          "operation": "create",
          "description": "Create internal transfer form with recipient user ID input, amount, source wallet selection, and confirmation modal. Submit transfer to backend for instant processing."
        },
        {
          "path": "frontend/src/components/client/CurrencyConversionForm.tsx",
          "operation": "create",
          "description": "Create currency conversion form with from/to currency dropdowns, amount input, live exchange rate display, and convert button. Submit conversion request to backend."
        },
        {
          "path": "frontend/src/components/client/TransactionHistory.tsx",
          "operation": "create",
          "description": "Create transaction history component with filters for date range, transaction type (Deposit, Withdraw, Transfer, Conversion), and status. Display paginated table with all transactions fetched from backend."
        },
        {
          "path": "frontend/src/hooks/useWalletOperations.ts",
          "operation": "create",
          "description": "Create React Query mutations for wallet operations (deposit, withdraw, transfer, convert) with optimistic updates and error handling"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /wallet requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Implement plan management for purchasing and tracking investment plans",
      "acceptanceCriteria": [
        "Users can select and purchase from the three plan tiers",
        "ROI tracker shows accumulated returns and remaining days",
        "Plan expiry date is clearly displayed",
        "Repurchase button is enabled when plan expires or is near expiry"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/PlansPage.tsx",
          "operation": "create",
          "description": "Create plans page displaying three investment tiers (BEGIN $100, GROW $300, PEAK $500) with features, ROI tracker showing daily progress, plan expiry countdown, and purchase/repurchase buttons. Fetch active plan and available plans from backend using React Query."
        },
        {
          "path": "frontend/src/components/client/PlanCard.tsx",
          "operation": "create",
          "description": "Create plan card component displaying plan name, price, ROI percentage, duration, and purchase button with confirmation modal"
        },
        {
          "path": "frontend/src/components/client/ROITracker.tsx",
          "operation": "create",
          "description": "Create ROI tracker component showing progress bar for accumulated returns, remaining days, total earned, and daily breakdown fetched from backend"
        },
        {
          "path": "frontend/src/hooks/usePlanManagement.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching available plans, active plan details, and mutation for purchasing/repurchasing plans"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /plans requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Implement referral module with personal link, downline list, and team tree visualization",
      "acceptanceCriteria": [
        "Referral link includes user's unique referral ID",
        "Link is copyable and shareable",
        "Downline list shows all direct referrals with join date and status",
        "Team tree visualizes multi-level referral hierarchy",
        "Referral earnings display total earned from direct referrals (10% bonus)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/ReferralPage.tsx",
          "operation": "create",
          "description": "Create referral page with personal referral link display with copy button, downline list table, team tree visualization, and referral earnings summary. Fetch referral data from backend using React Query."
        },
        {
          "path": "frontend/src/components/client/ReferralLinkCard.tsx",
          "operation": "create",
          "description": "Create referral link display component with copyable link including user's referral ID and share buttons"
        },
        {
          "path": "frontend/src/components/client/DownlineList.tsx",
          "operation": "create",
          "description": "Create downline list table component showing direct referrals with columns for name, join date, plan status, and earnings contribution"
        },
        {
          "path": "frontend/src/components/client/TeamTreeVisualization.tsx",
          "operation": "create",
          "description": "Create interactive team tree visualization component displaying multi-level referral hierarchy with expandable nodes, using canvas or SVG rendering"
        },
        {
          "path": "frontend/src/hooks/useReferralData.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching referral link, downline data, team tree structure, and referral earnings from backend"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /referrals requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Implement binary system display with left/right teams and matching visualization",
      "acceptanceCriteria": [
        "Each user has left and right leg placement in binary tree",
        "Frontend displays left/right team size and volumes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/BinaryPage.tsx",
          "operation": "create",
          "description": "Create binary system page displaying left and right team structures, team sizes, volumes, matched pairs count, binary income earned, daily limit progress, and carry-forward volume. Fetch binary data from backend using React Query."
        },
        {
          "path": "frontend/src/components/client/BinaryTreeVisualization.tsx",
          "operation": "create",
          "description": "Create binary tree visualization component showing user at root with left and right legs, team volumes, and visual indicators for matching status"
        },
        {
          "path": "frontend/src/components/client/BinaryStatsCard.tsx",
          "operation": "create",
          "description": "Create binary statistics card displaying left/right volumes, matched pairs, daily earnings, limit remaining, and carry-forward amounts"
        },
        {
          "path": "frontend/src/hooks/useBinaryData.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching binary tree structure, team volumes, matching history, and binary earnings from backend"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /binary requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Implement rewards section with milestone progress and claimed rewards history",
      "acceptanceCriteria": [
        "Milestones are displayed with target criteria and reward amounts",
        "Progress bars or indicators show current advancement",
        "Users can claim rewards when milestones are achieved",
        "Claimed rewards history shows date and amount"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/RewardsPage.tsx",
          "operation": "create",
          "description": "Create rewards page displaying available milestones with progress indicators, claim buttons for achieved milestones, and claimed rewards history table. Fetch milestone data from backend using React Query."
        },
        {
          "path": "frontend/src/components/client/MilestoneCard.tsx",
          "operation": "create",
          "description": "Create milestone card component showing milestone title, criteria, target value, current progress bar, reward amount, and claim button when eligible"
        },
        {
          "path": "frontend/src/components/client/ClaimedRewardsHistory.tsx",
          "operation": "create",
          "description": "Create claimed rewards history table displaying milestone name, achievement date, reward amount, and status"
        },
        {
          "path": "frontend/src/hooks/useRewardsData.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching milestones, progress data, claimed rewards history, and mutation for claiming rewards"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /rewards requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Implement earnings and transactions section with categorized income display and filters",
      "acceptanceCriteria": [
        "All income types are categorized and displayed separately",
        "Date range filter allows custom start and end dates",
        "Type filter allows filtering by income category",
        "Status filter shows pending, completed, or rejected transactions",
        "Transaction list is paginated and sortable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/EarningsPage.tsx",
          "operation": "create",
          "description": "Create earnings page with income breakdown by type (ROI, Referral, Binary, Rewards), filter controls for date range, type, and status, and paginated transaction table. Fetch earnings data from backend using React Query."
        },
        {
          "path": "frontend/src/components/client/EarningsBreakdown.tsx",
          "operation": "create",
          "description": "Create earnings breakdown component displaying total earnings with pie or bar chart showing distribution across ROI, Referral, Binary, and Rewards categories"
        },
        {
          "path": "frontend/src/components/client/TransactionFilters.tsx",
          "operation": "create",
          "description": "Create transaction filters component with date range picker, type dropdown, and status dropdown for filtering transactions"
        },
        {
          "path": "frontend/src/components/client/EarningsTable.tsx",
          "operation": "create",
          "description": "Create earnings table component with sortable columns for date, type, amount, status, and pagination controls"
        },
        {
          "path": "frontend/src/hooks/useEarningsData.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching earnings breakdown, filtered transactions with pagination, and export functionality"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /earnings requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Implement profile and settings section for personal information and security configuration",
      "acceptanceCriteria": [
        "Users can update name, phone, and country",
        "Password change requires current password verification",
        "Security settings include 2FA toggle",
        "KYC upload form accepts documents (optional)",
        "Notification preferences control email and in-app alerts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/client/ProfilePage.tsx",
          "operation": "create",
          "description": "Create profile page with tabs for Personal Info, Security, KYC, and Notifications. Display editable profile form and settings. Use the authorization component to fetch and update user profile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/client/PersonalInfoForm.tsx",
          "operation": "create",
          "description": "Create personal information form with editable fields for name, phone, country, and save button. Fetch and update user profile using authorization component methods."
        },
        {
          "path": "frontend/src/components/client/SecuritySettings.tsx",
          "operation": "create",
          "description": "Create security settings component with password change form requiring current password, 2FA enable/disable toggle, and active sessions list"
        },
        {
          "path": "frontend/src/components/client/KYCUploadForm.tsx",
          "operation": "create",
          "description": "Create optional KYC upload form with file inputs for identity documents and address proof. Use the blob-storage component for file uploads to placeholder storage. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/client/NotificationPreferences.tsx",
          "operation": "create",
          "description": "Create notification preferences form with toggles for email notifications, in-app alerts, and notification type selections"
        },
        {
          "path": "frontend/src/hooks/useProfileManagement.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching profile data using authorization component, and mutations for updating profile, changing password, and managing settings"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /profile requiring user authentication"
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Create admin panel overview dashboard with platform-wide metrics",
      "acceptanceCriteria": [
        "All seven metrics are displayed with current values",
        "Metrics update in real-time or on page refresh",
        "Charts or visualizations enhance data presentation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "create",
          "description": "Create admin dashboard page displaying total users, active users, new registrations, total deposits, total withdrawals, platform revenue, and pending approvals counts. Fetch admin metrics from backend using React Query. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/MetricsCard.tsx",
          "operation": "create",
          "description": "Create reusable metrics card component displaying metric label, value, and optional trend indicator"
        },
        {
          "path": "frontend/src/hooks/useAdminMetrics.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching admin dashboard metrics with polling for live updates"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/dashboard requiring admin authentication and role verification"
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Implement admin user management for viewing and modifying user accounts",
      "acceptanceCriteria": [
        "User list shows all registered users with search and filter",
        "User detail view displays complete profile and wallet information",
        "Admin can activate/suspend accounts with reason logging",
        "Password reset generates new credentials and notifies user",
        "Balance adjustment form updates specified wallet type",
        "Plan modification allows changing current plan or extending duration",
        "Referral tree view shows user's entire downline"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/UserManagementPage.tsx",
          "operation": "create",
          "description": "Create admin user management page with searchable and filterable user list table, user detail modal, and action buttons for activation, suspension, password reset, balance adjustment, plan modification, and referral tree view. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/UserListTable.tsx",
          "operation": "create",
          "description": "Create user list table with columns for ID, name, email, status, plan, join date, and actions. Include search by name/email and filters for status and plan."
        },
        {
          "path": "frontend/src/components/admin/UserDetailModal.tsx",
          "operation": "create",
          "description": "Create user detail modal displaying complete profile, wallet balances (Main, Earnings, Withdrawal), active plan, referral info, and action buttons"
        },
        {
          "path": "frontend/src/components/admin/BalanceAdjustmentForm.tsx",
          "operation": "create",
          "description": "Create balance adjustment form with wallet type selection (Main, Earnings, Withdrawal), amount input, adjustment type (add/subtract), and reason field"
        },
        {
          "path": "frontend/src/components/admin/PlanModificationForm.tsx",
          "operation": "create",
          "description": "Create plan modification form allowing admin to change user's active plan, extend duration, or cancel plan with reason"
        },
        {
          "path": "frontend/src/components/admin/UserReferralTreeModal.tsx",
          "operation": "create",
          "description": "Create modal displaying user's complete referral tree with expandable nodes showing downline hierarchy"
        },
        {
          "path": "frontend/src/hooks/useAdminUserManagement.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching user list, user details, and mutations for user actions (activate, suspend, reset password, adjust balance, modify plan)"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/users requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Implement admin financial control for deposit and withdrawal approval",
      "acceptanceCriteria": [
        "Deposit queue displays pending deposit requests",
        "Admin can approve deposits which credit user's Main wallet",
        "Admin can reject deposits with reason",
        "Manual deposit entry allows adding funds directly to user account",
        "Withdrawal queue displays pending withdrawal requests",
        "Admin can approve withdrawals which deduct from Withdrawal wallet",
        "Admin can reject withdrawals with reason",
        "Processing status tracks approval, payment processing, and completion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/FinancialControlPage.tsx",
          "operation": "create",
          "description": "Create financial control page with tabs for Deposits and Withdrawals, displaying pending request queues, approval/rejection forms, manual deposit entry, and processing status tracking. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/DepositQueueTable.tsx",
          "operation": "create",
          "description": "Create deposit queue table displaying pending deposits with user info, amount, currency, timestamp, and approve/reject action buttons"
        },
        {
          "path": "frontend/src/components/admin/WithdrawalQueueTable.tsx",
          "operation": "create",
          "description": "Create withdrawal queue table displaying pending withdrawals with user info, amount, wallet type, method, and approve/reject/track action buttons"
        },
        {
          "path": "frontend/src/components/admin/ManualDepositForm.tsx",
          "operation": "create",
          "description": "Create manual deposit form allowing admin to enter user ID, amount, currency, and notes to credit user account directly"
        },
        {
          "path": "frontend/src/components/admin/ApprovalModal.tsx",
          "operation": "create",
          "description": "Create reusable approval/rejection modal with confirmation message, optional reason field, and submit button"
        },
        {
          "path": "frontend/src/hooks/useAdminFinancial.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching deposit/withdrawal queues and mutations for approving, rejecting, and manually entering deposits"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/financial requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Implement admin plan management for creating and editing investment plans",
      "acceptanceCriteria": [
        "Plan creation form accepts name, price, ROI percentage, and duration in days",
        "Existing plans can be edited (changes apply to new purchases only)",
        "Plans can be enabled or disabled to control user visibility",
        "Plan list shows all configured plans with current status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/PlanManagementPage.tsx",
          "operation": "create",
          "description": "Create admin plan management page displaying list of all investment plans with status, create new plan button, edit buttons, and enable/disable toggles. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/PlanListTable.tsx",
          "operation": "create",
          "description": "Create plan list table showing plan name, price, ROI percentage, duration, status (enabled/disabled), and action buttons for edit and toggle"
        },
        {
          "path": "frontend/src/components/admin/PlanFormModal.tsx",
          "operation": "create",
          "description": "Create plan form modal for creating or editing plans with fields for name, price, ROI percentage, duration in days, and enabled status"
        },
        {
          "path": "frontend/src/hooks/useAdminPlans.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching plan list and mutations for creating, editing, and toggling plan status"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/plans requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Implement admin referral and binary configuration settings",
      "acceptanceCriteria": [
        "Referral percentage is globally configurable (default 10%)",
        "Binary pair income is configurable per plan tier",
        "Daily limit for binary earnings is configurable",
        "Carry-forward toggle enables or disables volume rollover",
        "Configuration changes are logged and effective immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ReferralBinaryConfigPage.tsx",
          "operation": "create",
          "description": "Create referral and binary configuration page with forms for setting referral bonus percentage, binary pair income per plan tier ($10/$30/$50), daily payout limit, and carry-forward logic toggle. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ReferralConfigForm.tsx",
          "operation": "create",
          "description": "Create referral configuration form with input for global referral bonus percentage and save button"
        },
        {
          "path": "frontend/src/components/admin/BinaryConfigForm.tsx",
          "operation": "create",
          "description": "Create binary configuration form with inputs for pair income per plan tier (BEGIN, GROW, PEAK), daily limit amount, and carry-forward toggle"
        },
        {
          "path": "frontend/src/hooks/useAdminConfig.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching current configuration and mutations for updating referral and binary settings"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/config requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Implement admin rewards management for defining and tracking milestones",
      "acceptanceCriteria": [
        "Milestone creation form accepts title, criteria type, threshold value, and reward amount",
        "Existing milestones can be edited or deleted",
        "Payout history shows all milestone achievements with user and date",
        "Admin can manually trigger milestone rewards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/RewardsManagementPage.tsx",
          "operation": "create",
          "description": "Create rewards management page displaying list of configured milestones, create/edit forms, payout history table, and manual trigger functionality. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/MilestoneListTable.tsx",
          "operation": "create",
          "description": "Create milestone list table showing milestone title, criteria type, threshold, reward amount, status, and action buttons for edit and delete"
        },
        {
          "path": "frontend/src/components/admin/MilestoneFormModal.tsx",
          "operation": "create",
          "description": "Create milestone form modal for creating or editing milestones with fields for title, criteria type (team size/volume/earnings), threshold value, and reward amount"
        },
        {
          "path": "frontend/src/components/admin/MilestonePayoutHistory.tsx",
          "operation": "create",
          "description": "Create payout history table displaying milestone name, user who achieved it, achievement date, reward amount, and status"
        },
        {
          "path": "frontend/src/hooks/useAdminRewards.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching milestones, payout history, and mutations for creating, editing, deleting milestones, and manually triggering payouts"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/rewards requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Implement admin reports and analytics with charts and export functionality",
      "acceptanceCriteria": [
        "Revenue report shows deposits, withdrawals, and net revenue over time",
        "User growth chart displays registration trends",
        "Earnings distribution pie or bar chart shows ROI, Referral, Binary, and Rewards breakdown",
        "Transaction logs are searchable and filterable by date, type, and user",
        "Export button generates CSV download of filtered data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ReportsPage.tsx",
          "operation": "create",
          "description": "Create reports and analytics page with tabs for Revenue, User Growth, Earnings Distribution, and Transaction Logs. Display charts and export buttons. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/RevenueChart.tsx",
          "operation": "create",
          "description": "Create revenue chart component displaying line or bar chart with deposits, withdrawals, and net revenue over time with date range selector"
        },
        {
          "path": "frontend/src/components/admin/UserGrowthChart.tsx",
          "operation": "create",
          "description": "Create user growth chart displaying registration trends over time with daily/weekly/monthly views"
        },
        {
          "path": "frontend/src/components/admin/EarningsDistributionChart.tsx",
          "operation": "create",
          "description": "Create earnings distribution chart showing pie or bar chart of total platform earnings by type (ROI, Referral, Binary, Rewards)"
        },
        {
          "path": "frontend/src/components/admin/TransactionLogsTable.tsx",
          "operation": "create",
          "description": "Create transaction logs table with search and filters for date range, transaction type, and user, displaying all platform transactions with export to CSV button"
        },
        {
          "path": "frontend/src/hooks/useAdminReports.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching revenue data, user growth data, earnings distribution, and transaction logs with export functionality"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/reports requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Implement admin notifications system for announcements and campaigns",
      "acceptanceCriteria": [
        "Announcement form creates messages displayed on user dashboards",
        "Email campaign interface allows selecting recipients and composing messages",
        "Platform alerts are triggered automatically for key events",
        "Notification history shows all sent messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/NotificationsPage.tsx",
          "operation": "create",
          "description": "Create admin notifications page with tabs for System Announcements, Email Campaigns, Platform Alerts, and History. Include forms for creating announcements and campaigns. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AnnouncementForm.tsx",
          "operation": "create",
          "description": "Create system announcement form with fields for title, message content, priority level, and publish button to display on all user dashboards"
        },
        {
          "path": "frontend/src/components/admin/EmailCampaignForm.tsx",
          "operation": "create",
          "description": "Create email campaign form with recipient selection (all users, specific segments, individual users), subject, message body, and send button (simulated email sending)"
        },
        {
          "path": "frontend/src/components/admin/PlatformAlertsList.tsx",
          "operation": "create",
          "description": "Create platform alerts list showing automatically triggered alerts for key events (large deposits, suspicious activity) with timestamps and details"
        },
        {
          "path": "frontend/src/components/admin/NotificationHistory.tsx",
          "operation": "create",
          "description": "Create notification history table displaying all sent announcements, campaigns, and alerts with type, recipients, date, and status"
        },
        {
          "path": "frontend/src/hooks/useAdminNotifications.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching notification history, platform alerts, and mutations for creating announcements and sending campaigns"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add protected route for /admin/notifications requiring admin authentication"
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Apply cohesive visual design system with professional financial aesthetic throughout the platform",
      "acceptanceCriteria": [
        "A unified color palette is applied across all pages",
        "Typography choices enhance readability and hierarchy",
        "Layout patterns are consistent and professional",
        "Design conveys trust, security, and modernity",
        "Visual style is distinct and not generic blue/purple"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define global design system variables including distinctive color palette (avoiding blue/purple), typography scale, spacing system, border radius, and shadow styles suitable for financial platform. Apply professional, modern aesthetic conveying trust and security."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind configuration with custom color palette, typography settings, and design tokens matching the financial platform aesthetic. Ensure colors are distinct from generic blue/purple schemes."
        },
        {
          "path": "frontend/src/components/layout/MainLayout.tsx",
          "operation": "create",
          "description": "Create main layout component for client dashboard with consistent header, sidebar navigation, and content area applying design system styles"
        },
        {
          "path": "frontend/src/components/layout/AdminLayout.tsx",
          "operation": "create",
          "description": "Create admin layout component with consistent header, sidebar navigation for admin pages, and content area applying design system styles"
        },
        {
          "path": "frontend/src/components/layout/PublicLayout.tsx",
          "operation": "create",
          "description": "Create public layout component for landing and auth pages with consistent header/footer and applying design system styles"
        }
      ]
    }
  ]
}